{"title": "The Thucydides trap: are the US and China headed for war?", "authors": "Graham Allison", "journal": "The Atlantic", "year": 2015, "cited": 206, "abstract": "When Barack Obama meets this week with Xi Jinping during the Chinese president’s first state visit to America, one item probably won’t be on their agenda: thepossibility that the United States and China could find themselves at war in the next decade. In policy circles, this appears as unlikely as it would be unwise. The rise of a 5,000-year-old civilization with 1.3 billion people is not a problem to be fixed. It is a condition—a chronic condition that will have to be managed over a generation. Success will require not just a new slogan, more frequent summits of presidents, and additional meetings of departmental working groups. Managing this relationship without war will demand sustained attention, week by week, at the highest level in both countries. It will entail a depth of mutual understanding not seen since the Henry Kissinger-Zhou Enlai conversations in the 1970s. Most significantly, it will mean more radical changes in attitudes and actions, by leaders and publics alike, than anyone has yet imagined."}
{"title": "Can China Avoid the Thucydides Trap?", "authors": "Zbigniew Brzezinski", "journal": "New Perspectives Quarterly", "year": 2014, "cited": 19, "abstract": "Despite grand visions of a cosmopolitan planet living in peace, the first globalization at the turn of the 20th century descended into World War I as the old empires scrambled to preserve themselves as others sought self‐determination. Powers on the losing end of that war reasserted themselves in yet another worldwide calamity within decades.After World War II, in the early 1950s, with the victorious American‐led alliance in the driver's seat, institutions such as the United Nations and the Bretton Woods arrangements created a global stability that enabled peace, prosperity and the “rise of the rest.” In 2014, the world order is shifting again with the rise of China reviving in Asia the very kind of nationalist rivalries that led Europe to war twice in the 20th century. Will we be able to build new institutions that accommodate the new powershift without resorting to war, or will the second globalization collapse as well? Top strategists from the US, Japan and China respond to this momentous question."}
{"title": "China, the United States, alliances, and war: avoiding the Thucydides trap?", "authors": "Lam Peng Er", "journal": "Asian Affairs: An American Review", "year": 2016, "cited": 15, "abstract": "Chinese President Xi Jinping emphatically rejects the so-called Thucydides Trap and its analogy that a rising China is destined for war with the United States, the status quo great power. But there is a contradiction between Beijing's peaceable rhetoric about a “New Type of Major Power Relations” with the US, and Beijing's disregard for the US and its allies. concerns about rising Chinese assertiveness in the East and South China Seas. It is not inconceivable that smaller Chinese and American allies in East Asia might well drag the US and China into a conflict rather than a conflict directly caused by the “power transition” between the two great powers per se."}
{"title": "Avoiding a Thucydides Trap in Sino-American relations (… and 7 reasons why that might be difficult)", "authors": "Gregory J. Moore", "journal": "Asian Security", "year": 2017 "cited": 14, "abstract": "In 2015, Harvard’s Graham Allison wrote an evocative article discussing the “Thucydides Trap” in relations between China and the United States, highlighting the danger of war between a rising power and a reigning power in the international system. Can China and the United States avoid the Thucydides Trap as China rises? This analysis identifies and analyzes seven reasons China and the US might not be able to avoid the trap: the bilateral strategic trust deficit, lack of agreement on the nature of the US pivot, recent trends in China’s maritime policies, disagreements over cyber security, security dynamics underlying China’s Anti-Access/Area Denial and Washington’s AirSea Battle strategies, recent trends in Sino-Russian strategic alignment, and Washington’s concerns about China’s increased defense spending."}
{"title": "Escape both the 'Thucydides Trap'and the 'Churchill Trap': Finding a Third Type of Great Power Relations under the Bipolar System", "authors": "Yuan Yang", "journal": "The Chinese Journal of International Politics", "year": 2018, "cited": 14, "abstract": "The ‘Thucydides trap’ exaggerates the risk of war breaking out between the rising power and the ruling power in the contemporary age. The greater challenge facing China and the United States is to avoid falling into the ‘Churchill trap’. That is, falling into a long-term confrontation by repeating the mistakes of the Cold War between the US and the USSR. Both the ‘old’ history of the ancient East Asian bipolar system and the current experience of Sino-US interaction in East Asia suggest that, in addition to hegemonic war and cold war, there is a third type of great power relationship between the two poles, which I call ‘co-ruling’, whereby rather than being geographically demarcated according to their respective ‘spheres of influence’, the two superpowers jointly lead all or most of the small and medium-sized countries in the system. The theoretical and case studies examined in the article imply that the ‘co-ruling’ mode will appear and be sustained at a time when the two superpowers’ foreign functions are differentiated (i.e. each of the two poles can only meet one of the indispensable needs of small countries, and the two needs that the two poles can respectively meet are different ones), when inter-great-power war is no longer a viable strategic option. The antagonistic and geopolitical colours of the Cold War ‘divided-ruling’ mode of power politics will be less strident in the ‘co-ruling’ mode, so offering an illuminating escape from both the ‘Thucydides trap’ and the ‘Churchill trap’."}
{"title": "The Thucydides Trap as an Alternative Explanation for the US–China Trade War", "authors": "Imad A. Moosa", "journal": "Global Journal of Emerging Market Economies", "year": 2020, "cited": 5, "abstract": "The current trade war between the USA and China is perceived to be motivated by the US desire to curtail the bilateral trade deficit, on the assumption that reducing the deficit boosts economic growth. This flawed proposition indicates gross misunderstanding of the national income identity and the basic principles of macroeconomics. The imposition of tariffs will not reduce the trade deficit as the assumptions and conditions required for a smooth working of the process are unrealistic and counterfactual. The notion of an economic Thucydides trap is put forward to explain why the trade war is motivated by US apprehension about China’s rising economic power."}
{"title": "Did Thucydides Believe in Thucydides' Trap? The History of the Peloponnesian War and Its Relevance to US-China Relations", "authors": "James Lee", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 6, "abstract": "The Peloponnesian War, a conflict between the Greek city-states of Athens and Sparta and their respective allies, is held to be a classic example of war between a hegemon and a rising power. Graham Allison has recently coined the term “Thucydides’ Trap” to emphasize how structural forces are leading to instability in U.S.-China relations. This interpretation of history is inaccurate and reflects the influence of misleading translations. Drawing on the original Greek text of Thucydides’ History of the Peloponnesian War, I argue that the concept of Thucydides’ Trap does not find support even in the case that has given it its name. Thucydides’ famous attribution of the war to “the growth of the power of Athens” actually refers to the expansion of the Athenian Empire rather than a shift in the distribution of capabilities. Structural arguments do offer valuable insights about potential sources of conflict in U.S.-China relations, but the causal mechanism has little to do with the analogy of Athens and Sparta. As exemplified by the flashpoint in the Strait of Taiwan, structural change has aggravated long-standing differences between the United States and the PRC. Beijing’s growing economic and military power has resulted in a growing threat to Taipei, which has led the United States to affirm its commitment to Taiwan’s security in ways that are inconsistent with the One-China policy. If this trend continues, it will raise the potential for a military confrontation between the great powers in East Asia."}
{"title": "The perils of hubris? A tragic reading of “Thucydides' trap” and China-US relations", "authors": "Biao Zhang", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 3, "abstract": "In the last few years, Graham Allison’s “Thucydides’ Trap” has stimulated much discussion within International Relations (IR). Most IR scholars understand Thucydides’ Trap as a shorthand for power transition theory, and view it as highly inadequate for analyzing China-US relations. This article seeks to offer an alternative, tragic, understanding of Thucydides’ Trap that may have more purchase on the analysis of the dynamic of China-US relations. It first argues that while Thucydides’ Trap shares power transition theory’s focus on the shifting balance of power, it is also different from the latter in its emphasis on the emotional implications of changes in the balance of power. This article then explores a tragic understanding of Thucydides’ Trap. Economic success often encourages a rising power to display ambition, confidence and enhanced sense of self (what Allison calls “rising power syndrome”), which leads to loosened restraint, overextension, and strategic blunder; meanwhile, its assertive and ambitious moves spark a ruling power’s fear, insecurity and even paranoia (what Allison calls “ruling power syndrome”), which prompts it to take “preventive” actions in response to the rising power’s assertiveness. This article finally looks at China-US relations through this tragic lens. It suggests that this tragic understanding of Thucydides’ Trap can illuminate the emotional aspect of China-US relations, and also argues that the Thucydides Trap Research Project should henceforth develop an emotional line of inquiry into interaction between the great powers."}
{"title": "Introduction: Can America and China Escape the Thucydides Trap?", "authors": "Chunman Zhang & Xiaoyu Pu", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 6, "abstract": "Can China rise peacefully? Will China and the United States go to war? As U.S. and China face rising tensions in trade, technology, cyberspace, and the South China Sea, etc., scholars are concerned about the future of the Sino-U.S. relationship. In history, the relationship between a rising power and a hegemonic power often ends up with severe conflicts, even wars. The main reason is probably the Thucydides Trap, which Graham Allison defines as the severe structural stress caused when a rising power threatens to upend a ruling one. This special issue invite scholars from China, U.S. and other countries to examine the theoretical mechanisms and policy implications of the Thucydides Trap. Each of these articles in this special issue examines unique problems and makes original contributions to our understanding of the Thucydides Trap and U.S.-China relationship. Most authors in this special issue believe that the Thucydides Trap provides a useful lens for studying the China-U.S. relationship in spite of some reservations. This special issue addresses two broad questions: First, how can one construct a thick and comprehensive understanding of the Thucydides Trap? Second, how to analyze, examine and even predict the tensions, problems and future of the Sino-U.S. relationship? There is no doubt that the current relationship between the two has deteriorated to an extent that old paradigms of conflict resolutions seem to be obsolete. Although it’s difficult to predict the future of Sino-U.S. relations, both countries especially political leaders can search for new paradigms to escape the Thucydides Trap. America and China are not destined for war, but destined for an uncertain future."}
{"title": "More than one trap: Problematic interpretations and overlooked lessons from Thucydides", "authors": "Steve Chan", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 5, "abstract": "Popular rendition of the so-called Thucydides’ Trap focuses excessively on only one possible explanation of interstate wars to the exclusion of others. It also commits various acts of commission and omission that threaten the validity of its central proposition. This essay reviews some of the major problems pertaining to the logic of inquiry characteristic to this genre of analysis, its interpretation of historical evidence, and its neglect of alternative explanations of war – even those that Thucydides had written about in his account. There is a danger of self-fulfilling prophecy to the extent that leaders in Beijing and Washington are inclined to believe in an analogy to an ancient war that happened some 2500 years ago. Conventional invocations of Thucydides’ Trap fail to recognize that there are several possible pathways to war. Because they offer only a structural explanation based on interstate power shifts, they give short shrift to the role of human agency and fail to attend sufficiently to what leaders can do to avoid conflict."}
{"title": "Can the United States and China avoid a Thucydides trap", "authors": "David A. Welch", "journal": "Centre for International Governance Innovation", "year": 2015, "cited": 6, "abstract": "In 2003 I published an essay titled, “Why International Relations Theorists Should Stop Reading Thucydides.” I thought I made a pretty strong case. There was, first of all, the question of anachronism. No modern doctor would base his or her medical practice on the writings of Erasistratus, Herophilus, or Hippocrates, but for some reason International Relations scholars seem to think that whatever Thucydides wrote almost 2,500 years ago still applies today. There was also the question of accuracy. Thucydides told a pretty good tale, but much of it, and certainly the most famous parts, had a “take my word for it” kind of feel. The single most important bit—the claim that “[t]he growth of the power of Athens, and the alarm which this inspired in Sparta, made war inevitable” and that the Spartans went to war with Athens “not so much because they were persuaded by the arguments of the allies, as because they feared the growth of the power of the Athenians, seeing most of Hellas already subject to them”[1]— was, in fact, supported by no evidence whatsoever and contradicted by a very great deal. Thucydides admitted as much himself when he wrote, “The real cause [of war] . . . I consider to be the one which was formally most kept out of sight”[2]. Finally, even if Thucydides still applied, and even if what he said was accurate, there was the question of takeaway. His History is so rich that anyone with any paradigmatic predilection whatsoever could mine it for aid and comfort. If IR theorists were the proverbial blind men, Thucydides would be the proverbial elephant. The Realists got to him first and prominently staked their claim, but there is a very great deal in what he wrote, I argued, that is flatly inconsistent with the Realist take. Arguably, “The Thucydides Trap” may prove to be moot. There is nothing inevitable about China’s rise. It is entirely possible that China may sputter, fragment, or collapse. But if it does continue to rise, the main dangers lie not with “THE” Thucydides Trap—a conscious calculation on the part of American leaders that war with China sooner is preferable to a war with China later (or kowtowing to Beijing once it has risen fully)—but with one of the many other (more likely) push, pull, or stumble traps so eloquently described by Thucydides that have largely gone unnoticed."}
{"title": "The Thucydides Trap and the Korean Peninsula: So why Won't the USA and China Get Caught?", "authors": "Zhaoying Han & Richard J. Cook & Maximilian Ohle", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 2, "abstract": "“It was the rise of Athens and the fear that it instilled in Sparta that made war inevitable” as Thucydides famously stated. But are we destined to hear echoes of “Carthago delenda est” [Carthage must be destroyed] from Beijing and Washington across the Pacific? With the tension notably on the rise in the issue-specific domains of the Taiwan Strait, South China Sea, and the Korean Peninsula, there is cause to delve deeper into the contemporary ‘Thucydides Trap’, as expounded by Graham Allison. This paper will focus on the latest developments of the ongoing Korean Peninsula Nuclear Crisis, post Six-Party Talks, as an issue-specific domain to evaluate the changing power dynamic between an established and a rising power. Here the Thucydides Trap and the challenges presented by policy makers in both China and the USA make special reference to the danger of being plunged into a hegemonic conflict. This analysis covers two trajectories: 1) following the conservative approach – balance of power and conditions of hegemony; and 2) concerning a balance of hierarchies – in which the two hierarchies run parallel to each other. Due to China’s rising power in both military and economic fields, it simultaneously presages the relative decline of American power projection. Allison also reconfirms that an established power, in this case the USA, is challenged by a rising power, personified by China, concludes that the likelihood of war has substantially increased. Despite the fact of their growing geopolitical rivalry, both acknowledge the calculus of falling into the trap and realize that a major conflict would devastate their geopolitical positions. Put more directly, finding the great escape from this trap remains the central issue in the contemporary world, raising the conceptionally challenging question as to whether Allison’s theoretical construction is heuristically sound."}
{"title": "Uncertainty, shifting power and credible signals in US-China relations: Why the “Thucydides Trap” is real, but limited", "authors": "Brandon K. Yoder", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 2, "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}
{"title": "", "authors": "", "journal": "", "year": , "cited": , "abstract": ""}