{"title": "The Thucydides trap: are the US and China headed for war?", "authors": "Graham Allison", "journal": "The Atlantic", "year": 2015, "cited": 206, "abstract": "When Barack Obama meets this week with Xi Jinping during the Chinese president’s first state visit to America, one item probably won’t be on their agenda: thepossibility that the United States and China could find themselves at war in the next decade. In policy circles, this appears as unlikely as it would be unwise. The rise of a 5,000-year-old civilization with 1.3 billion people is not a problem to be fixed. It is a condition—a chronic condition that will have to be managed over a generation. Success will require not just a new slogan, more frequent summits of presidents, and additional meetings of departmental working groups. Managing this relationship without war will demand sustained attention, week by week, at the highest level in both countries. It will entail a depth of mutual understanding not seen since the Henry Kissinger-Zhou Enlai conversations in the 1970s. Most significantly, it will mean more radical changes in attitudes and actions, by leaders and publics alike, than anyone has yet imagined."}
{"title": "Can China Avoid the Thucydides Trap?", "authors": "Zbigniew Brzezinski", "journal": "New Perspectives Quarterly", "year": 2014, "cited": 19, "abstract": "Despite grand visions of a cosmopolitan planet living in peace, the first globalization at the turn of the 20th century descended into World War I as the old empires scrambled to preserve themselves as others sought self‐determination. Powers on the losing end of that war reasserted themselves in yet another worldwide calamity within decades.After World War II, in the early 1950s, with the victorious American‐led alliance in the driver's seat, institutions such as the United Nations and the Bretton Woods arrangements created a global stability that enabled peace, prosperity and the “rise of the rest.” In 2014, the world order is shifting again with the rise of China reviving in Asia the very kind of nationalist rivalries that led Europe to war twice in the 20th century. Will we be able to build new institutions that accommodate the new powershift without resorting to war, or will the second globalization collapse as well? Top strategists from the US, Japan and China respond to this momentous question."}
{"title": "China, the United States, alliances, and war: avoiding the Thucydides trap?", "authors": "Lam Peng Er", "journal": "Asian Affairs: An American Review", "year": 2016, "cited": 15, "abstract": "Chinese President Xi Jinping emphatically rejects the so-called Thucydides Trap and its analogy that a rising China is destined for war with the United States, the status quo great power. But there is a contradiction between Beijing's peaceable rhetoric about a “New Type of Major Power Relations” with the US, and Beijing's disregard for the US and its allies. concerns about rising Chinese assertiveness in the East and South China Seas. It is not inconceivable that smaller Chinese and American allies in East Asia might well drag the US and China into a conflict rather than a conflict directly caused by the “power transition” between the two great powers per se."}
{"title": "Avoiding a Thucydides Trap in Sino-American relations (… and 7 reasons why that might be difficult)", "authors": "Gregory J. Moore", "journal": "Asian Security", "year": 2017, "cited": 14, "abstract": "In 2015, Harvard’s Graham Allison wrote an evocative article discussing the “Thucydides Trap” in relations between China and the United States, highlighting the danger of war between a rising power and a reigning power in the international system. Can China and the United States avoid the Thucydides Trap as China rises? This analysis identifies and analyzes seven reasons China and the US might not be able to avoid the trap: the bilateral strategic trust deficit, lack of agreement on the nature of the US pivot, recent trends in China’s maritime policies, disagreements over cyber security, security dynamics underlying China’s Anti-Access/Area Denial and Washington’s AirSea Battle strategies, recent trends in Sino-Russian strategic alignment, and Washington’s concerns about China’s increased defense spending."}
{"title": "Escape both the 'Thucydides Trap'and the 'Churchill Trap': Finding a Third Type of Great Power Relations under the Bipolar System", "authors": "Yuan Yang", "journal": "The Chinese Journal of International Politics", "year": 2018, "cited": 14, "abstract": "The ‘Thucydides trap’ exaggerates the risk of war breaking out between the rising power and the ruling power in the contemporary age. The greater challenge facing China and the United States is to avoid falling into the ‘Churchill trap’. That is, falling into a long-term confrontation by repeating the mistakes of the Cold War between the US and the USSR. Both the ‘old’ history of the ancient East Asian bipolar system and the current experience of Sino-US interaction in East Asia suggest that, in addition to hegemonic war and cold war, there is a third type of great power relationship between the two poles, which I call ‘co-ruling’, whereby rather than being geographically demarcated according to their respective ‘spheres of influence’, the two superpowers jointly lead all or most of the small and medium-sized countries in the system. The theoretical and case studies examined in the article imply that the ‘co-ruling’ mode will appear and be sustained at a time when the two superpowers’ foreign functions are differentiated (i.e. each of the two poles can only meet one of the indispensable needs of small countries, and the two needs that the two poles can respectively meet are different ones), when inter-great-power war is no longer a viable strategic option. The antagonistic and geopolitical colours of the Cold War ‘divided-ruling’ mode of power politics will be less strident in the ‘co-ruling’ mode, so offering an illuminating escape from both the ‘Thucydides trap’ and the ‘Churchill trap’."}
{"title": "The Thucydides Trap as an Alternative Explanation for the US–China Trade War", "authors": "Imad A. Moosa", "journal": "Global Journal of Emerging Market Economies", "year": 2020, "cited": 5, "abstract": "The current trade war between the USA and China is perceived to be motivated by the US desire to curtail the bilateral trade deficit, on the assumption that reducing the deficit boosts economic growth. This flawed proposition indicates gross misunderstanding of the national income identity and the basic principles of macroeconomics. The imposition of tariffs will not reduce the trade deficit as the assumptions and conditions required for a smooth working of the process are unrealistic and counterfactual. The notion of an economic Thucydides trap is put forward to explain why the trade war is motivated by US apprehension about China’s rising economic power."}
{"title": "Did Thucydides Believe in Thucydides' Trap? The History of the Peloponnesian War and Its Relevance to US-China Relations", "authors": "James Lee", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 6, "abstract": "The Peloponnesian War, a conflict between the Greek city-states of Athens and Sparta and their respective allies, is held to be a classic example of war between a hegemon and a rising power. Graham Allison has recently coined the term “Thucydides’ Trap” to emphasize how structural forces are leading to instability in U.S.-China relations. This interpretation of history is inaccurate and reflects the influence of misleading translations. Drawing on the original Greek text of Thucydides’ History of the Peloponnesian War, I argue that the concept of Thucydides’ Trap does not find support even in the case that has given it its name. Thucydides’ famous attribution of the war to “the growth of the power of Athens” actually refers to the expansion of the Athenian Empire rather than a shift in the distribution of capabilities. Structural arguments do offer valuable insights about potential sources of conflict in U.S.-China relations, but the causal mechanism has little to do with the analogy of Athens and Sparta. As exemplified by the flashpoint in the Strait of Taiwan, structural change has aggravated long-standing differences between the United States and the PRC. Beijing’s growing economic and military power has resulted in a growing threat to Taipei, which has led the United States to affirm its commitment to Taiwan’s security in ways that are inconsistent with the One-China policy. If this trend continues, it will raise the potential for a military confrontation between the great powers in East Asia."}
{"title": "The perils of hubris? A tragic reading of “Thucydides' trap” and China-US relations", "authors": "Biao Zhang", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 3, "abstract": "In the last few years, Graham Allison’s “Thucydides’ Trap” has stimulated much discussion within International Relations (IR). Most IR scholars understand Thucydides’ Trap as a shorthand for power transition theory, and view it as highly inadequate for analyzing China-US relations. This article seeks to offer an alternative, tragic, understanding of Thucydides’ Trap that may have more purchase on the analysis of the dynamic of China-US relations. It first argues that while Thucydides’ Trap shares power transition theory’s focus on the shifting balance of power, it is also different from the latter in its emphasis on the emotional implications of changes in the balance of power. This article then explores a tragic understanding of Thucydides’ Trap. Economic success often encourages a rising power to display ambition, confidence and enhanced sense of self (what Allison calls “rising power syndrome”), which leads to loosened restraint, overextension, and strategic blunder; meanwhile, its assertive and ambitious moves spark a ruling power’s fear, insecurity and even paranoia (what Allison calls “ruling power syndrome”), which prompts it to take “preventive” actions in response to the rising power’s assertiveness. This article finally looks at China-US relations through this tragic lens. It suggests that this tragic understanding of Thucydides’ Trap can illuminate the emotional aspect of China-US relations, and also argues that the Thucydides Trap Research Project should henceforth develop an emotional line of inquiry into interaction between the great powers."}
{"title": "Introduction: Can America and China Escape the Thucydides Trap?", "authors": "Chunman Zhang & Xiaoyu Pu", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 6, "abstract": "Can China rise peacefully? Will China and the United States go to war? As U.S. and China face rising tensions in trade, technology, cyberspace, and the South China Sea, etc., scholars are concerned about the future of the Sino-U.S. relationship. In history, the relationship between a rising power and a hegemonic power often ends up with severe conflicts, even wars. The main reason is probably the Thucydides Trap, which Graham Allison defines as the severe structural stress caused when a rising power threatens to upend a ruling one. This special issue invite scholars from China, U.S. and other countries to examine the theoretical mechanisms and policy implications of the Thucydides Trap. Each of these articles in this special issue examines unique problems and makes original contributions to our understanding of the Thucydides Trap and U.S.-China relationship. Most authors in this special issue believe that the Thucydides Trap provides a useful lens for studying the China-U.S. relationship in spite of some reservations. This special issue addresses two broad questions: First, how can one construct a thick and comprehensive understanding of the Thucydides Trap? Second, how to analyze, examine and even predict the tensions, problems and future of the Sino-U.S. relationship? There is no doubt that the current relationship between the two has deteriorated to an extent that old paradigms of conflict resolutions seem to be obsolete. Although it’s difficult to predict the future of Sino-U.S. relations, both countries especially political leaders can search for new paradigms to escape the Thucydides Trap. America and China are not destined for war, but destined for an uncertain future."}
{"title": "More than one trap: Problematic interpretations and overlooked lessons from Thucydides", "authors": "Steve Chan", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 5, "abstract": "Popular rendition of the so-called Thucydides’ Trap focuses excessively on only one possible explanation of interstate wars to the exclusion of others. It also commits various acts of commission and omission that threaten the validity of its central proposition. This essay reviews some of the major problems pertaining to the logic of inquiry characteristic to this genre of analysis, its interpretation of historical evidence, and its neglect of alternative explanations of war – even those that Thucydides had written about in his account. There is a danger of self-fulfilling prophecy to the extent that leaders in Beijing and Washington are inclined to believe in an analogy to an ancient war that happened some 2500 years ago. Conventional invocations of Thucydides’ Trap fail to recognize that there are several possible pathways to war. Because they offer only a structural explanation based on interstate power shifts, they give short shrift to the role of human agency and fail to attend sufficiently to what leaders can do to avoid conflict."}
{"title": "Can the United States and China avoid a Thucydides trap", "authors": "David A. Welch", "journal": "Centre for International Governance Innovation", "year": 2015, "cited": 6, "abstract": "In 2003 I published an essay titled, “Why International Relations Theorists Should Stop Reading Thucydides.” I thought I made a pretty strong case. There was, first of all, the question of anachronism. No modern doctor would base his or her medical practice on the writings of Erasistratus, Herophilus, or Hippocrates, but for some reason International Relations scholars seem to think that whatever Thucydides wrote almost 2,500 years ago still applies today. There was also the question of accuracy. Thucydides told a pretty good tale, but much of it, and certainly the most famous parts, had a “take my word for it” kind of feel. The single most important bit—the claim that “[t]he growth of the power of Athens, and the alarm which this inspired in Sparta, made war inevitable” and that the Spartans went to war with Athens “not so much because they were persuaded by the arguments of the allies, as because they feared the growth of the power of the Athenians, seeing most of Hellas already subject to them”[1]— was, in fact, supported by no evidence whatsoever and contradicted by a very great deal. Thucydides admitted as much himself when he wrote, “The real cause [of war] . . . I consider to be the one which was formally most kept out of sight”[2]. Finally, even if Thucydides still applied, and even if what he said was accurate, there was the question of takeaway. His History is so rich that anyone with any paradigmatic predilection whatsoever could mine it for aid and comfort. If IR theorists were the proverbial blind men, Thucydides would be the proverbial elephant. The Realists got to him first and prominently staked their claim, but there is a very great deal in what he wrote, I argued, that is flatly inconsistent with the Realist take. Arguably, “The Thucydides Trap” may prove to be moot. There is nothing inevitable about China’s rise. It is entirely possible that China may sputter, fragment, or collapse. But if it does continue to rise, the main dangers lie not with “THE” Thucydides Trap—a conscious calculation on the part of American leaders that war with China sooner is preferable to a war with China later (or kowtowing to Beijing once it has risen fully)—but with one of the many other (more likely) push, pull, or stumble traps so eloquently described by Thucydides that have largely gone unnoticed."}
{"title": "The Thucydides Trap and the Korean Peninsula: So why Won't the USA and China Get Caught?", "authors": "Zhaoying Han & Richard J. Cook & Maximilian Ohle", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 2, "abstract": "“It was the rise of Athens and the fear that it instilled in Sparta that made war inevitable” as Thucydides famously stated. But are we destined to hear echoes of “Carthago delenda est” [Carthage must be destroyed] from Beijing and Washington across the Pacific? With the tension notably on the rise in the issue-specific domains of the Taiwan Strait, South China Sea, and the Korean Peninsula, there is cause to delve deeper into the contemporary ‘Thucydides Trap’, as expounded by Graham Allison. This paper will focus on the latest developments of the ongoing Korean Peninsula Nuclear Crisis, post Six-Party Talks, as an issue-specific domain to evaluate the changing power dynamic between an established and a rising power. Here the Thucydides Trap and the challenges presented by policy makers in both China and the USA make special reference to the danger of being plunged into a hegemonic conflict. This analysis covers two trajectories: 1) following the conservative approach – balance of power and conditions of hegemony; and 2) concerning a balance of hierarchies – in which the two hierarchies run parallel to each other. Due to China’s rising power in both military and economic fields, it simultaneously presages the relative decline of American power projection. Allison also reconfirms that an established power, in this case the USA, is challenged by a rising power, personified by China, concludes that the likelihood of war has substantially increased. Despite the fact of their growing geopolitical rivalry, both acknowledge the calculus of falling into the trap and realize that a major conflict would devastate their geopolitical positions. Put more directly, finding the great escape from this trap remains the central issue in the contemporary world, raising the conceptionally challenging question as to whether Allison’s theoretical construction is heuristically sound."}
{"title": "Uncertainty, shifting power and credible signals in US-China relations: Why the “Thucydides Trap” is real, but limited", "authors": "Brandon K. Yoder", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 2, "abstract": "Is conflict between a rising China and a declining United States inevitable? One of the main purported drivers of the “Thucydides Trap” is that declining states face intractable uncertainty about rising states’ future intentions. Since a declining state cannot be sure how a rising state will use its power in the future, the decliner faces strong incentives to initiate preventive action, possibly war, to forestall the power shift, even if the rising state has behaved cooperatively to date. A common conclusion is therefore that preventive war is often unavoidable under large power shifts, even between states with truly compatible goals. Drawing on recently-published formal work, this paper argues that the uncertainty underpinning the Thucydides Trap is not as pervasive as conventional wisdom holds. Indeed, even under large power shifts, rising states’ cooperative signals should be sufficiently credible that preventive war should not occur when the declining state is initially uncertain of the riser’s intentions. Rather, preventive war should occur only if the declining state has high confidence that the riser’s intentions are truly hostile. The analysis yields two main conclusions. First, China’s cooperation has been sufficiently credible to avert preventive war, but not to avoid a substantial degree of competition with the US, which has rationally hedged against China’s rising power. However, American observers have often misinterpreted the credibility of both cooperative and non-cooperative Chinese signals, and the current US government is far too confident that China harbors hostile intentions. This leaves open the possibility of a US-China war due to psychological misperceptions."}
{"title": "Appraising the “Thucydides Trap” Geographically: The Korean Factor in Sino‐US Relations", "authors": "Xiangfeng Yang", "journal": "Pacific Focus", "year": 2019, "cited": 0, "abstract": "In lieu of taking stock of the many problems presently plaguing Sino‐US relations, this research zeroes in on just one of them – the evolving situation on the Korean Peninsula that has both alarmed and captivated the world. Korea, prima facie, is a case that has the likely potential to erupt into an open conflict between China and the United States. Situated against the broad context of great power entanglement on the Peninsula, this paper examines the convergence, as well as divergence, of interests and strategic objectives for both China and the United States in terms of areas of cooperation and competition. It argues that their shared aversion to a war, and the complex, multilateral nature of the matter, distinguishes Korea from other disputes, particularly Taiwan and the South China Sea. Korea, therefore, is not at the center of a Sino‐US Thucydides Trap. Nevertheless, Sino‐US competition to shape the future of the strategic landscape of the Peninsula will undoubtedly continue and might even intensify."}
{"title": "China-US Trade War: a 21st Century Thucydides Trap?", "authors": "Yuqing Xing", "journal": "National Graduate Institute for Policy Studies", "year": 2018, "cited": 1, "abstract": "This paper provides a comprehensiveanalysis ofthe on-going China-US trade war, similar to the Thucydides Trap in terms of competing for global economic dominance.It analyzes what the US attempts to achieve through the trade war and why China has been refusingthe reciprocal trade relations urged by President Trump. It also identifies social and economic changes in American society,  whichmotivate  President  Trump  to impose  punitive  tariffs  on  Chinese  goods. It emphasizes that the trade war is asymmetric and China will definitely suffer more losses than the USif  the  trade  war  escalates  further. At  the  end  of  the  paper, it  suggests that,  to  avoid  the devastating  result  of  the Thucydides  Trap, China  should  further  open  its domestic  market to American companies and actively pursuenegotiationswith theUSfor resolving the dispute."}
{"title": "US–China Rivalry and 'Thucydides' Trap': Why this is a misleading account", "authors": "Michael A. Peters & Benjamin Green & Chunxiao Mou & Stephanie Hollings & Moses Oladele Ogunniran & Fazal Rizvi & Sharon Rider & Rob Tierney", "journal": "Educational Philosophy and Theory", "year": 2020, "cited": 0, "abstract": "Reading Thucydides’ account of the Plague of Athens, even though he was not present, one can understand the label of ‘scientific history’ and why Thucydides is regarded by some as one the greatest historians of all time, alongside Herodotus. Thucydides’ work and a particular historical interpretation of the Peloponnesian War has become the basis for a framework assessing whether the US and China are destined for war at exactly the time of another great plague, COVID-19 a major global pandemic in 2019–2020. The stakes are very high as President Trump, deflecting responsibility for the ineptitude of his administration in managing the crisis, blames China and talks of cutting all ties with China, while China retaliates by indicating if that happened they would take Taiwan by force. 1 This latest escalation of tensions represents a new low-point in US–China relations and seems to verify the notion of ‘Thucydides Trap’ as a probably outcome for an escalating crisis that in its current form first emerged with Trump’s anti-China election rhetoric.The statements by Chinese officials suggest that the Chinese leadership are more intent on fending off attacks by counters (often equivalent to ‘tit for tat’). More significantly, China seems focused primarily on building alliances and enlisting the support of global agencies in ways that might thwart US attacks on China. While they might offer counters to US attacks, they seem to view the US rhetoric as banter tied to US competitive ambitions amidst the dire circumstances of the pandemic concerns of dwindling support going into an election. Accordingly, based upon Chinese press releases, it is conjectured that China holds a long view and the pursuit of global revelations that are multi-perspectival respecting diversity, reciprocity and reflexivity (Cao, 2019). Chinese espoused interests are touted as being aligned with the pursuit of dialogue based upon respect and recognition and pursuit of peaceful coexistence not confrontation. As President Xi suggested in his keynote at the Asia Pacific Economic Cooperation Summit in Papua New Guinea in 2018, China would prefer a global world view that whereby countries exist ‘intertwined’ as ‘links in global chain of cooperation: increasingly we are becoming one and the same community with shared interests and a shared future’ (Xi, 2018). I would surmise that Chinese leadership is adroit in its responses as it stays committed to how China might capitalize upon and pursue the circumstances that align with the world that modern China imagines."}
{"title": "The Thucydides Trap Discourse in China-US Relations", "authors": "Cai Cuihong", "journal": "China International Studies", "year": 2016, "cited": 2, "abstract": "Thucydides Trap is the description about the cause for the war between Athens and Sparta in BC5 in The Peloponnesian War by Thucydides, which states that it was the increasing of Athenian power and the fear it inspired in Sparta that made the war inevitable. Thucydides thinks that the competition between a rising power and the existing ruling hegemony mostly ends up with wars. In another word, the Thucydides Trap refers to that a rising power is bound to challenge the existing dominant power and the dominant power in turn will certainly make a response to the threat. In the end the war cannot be avoided. Admittedly, that China-US relations can avert the Thucydides Trap doesn't mean that we can rest easy. But after all, the Thucydides Trap is just a theoretical hypothesis and unlikely to be self-realized even if all conditions are met. Early in 2005, Joseph Nye suggested that the war was not inevitable though the concerns of Sparta about the strong economic rise of Athens constituted the root of the Peloponnesian War and the war could completely be circumvented through negotiations and people's sensible policies. China and the US are able to realize a long-term stable relationship in these ways. Wars won't and shouldn't occur between the two countries. The leaders of the former Soviet Union and the US could refrain from wars during the Cold War, let alone today's leaders of China and the US. Fortunately, avoiding falling into the Thucydides Trap has become the common view at the top levels in China and the US with the explicitation of this conception. Just as President Xi Jinping mentioned in his speech at Seattle during the visit to the US, there is no such thing as the so-called Thucydides Trap in the world and both countries shall persist in the correct direction of building a new pattern of major-country relations."}
{"title": "The Thucydides' Trap, Rationalist Theories of War, and the China-US Relations", "authors": "Cathy Xuanxuan Wu", "journal": "Rationalist Theories of War, and the China-US Relations", "year": 2018, "cited": 1, "abstract": "The key elements of the Thucydides Trap—the rise of Athens and the fear in Sparta—inspire two fundamental origins of war identified by the rationalist theories of war: the commitment problem and the information problem. The information problem focuses on war driven by uncertainty and the ineffectiveness of communication between states, whereas the commitment problem attributes the occurrence of war to large and rapid shifts in the distribution of power. Applying the rationalist theories of war, I argue that the recent development of China-US relations is unlikely to lead to war. First, because the current information problem between China and the US mainly comes from leadership turnover and the transformations of foreign policy associated with it, the mutual uncertainty is likely to decline after frequent interactions. Second, as the dimensions of power expand nowadays, the risk of war due to the commitment problem decreases, for states are less likely to experience large and rapid shifts of power simultaneously in multiple dimensions. As a result, the US may find it too costly to launch a preventive war and resort to other nonviolent tools, such as trade war, to slow down the process of power transition. The effects of the ongoing trade war remain unclear, further reducing the risk of war. Finally, I discuss how the current development of China-US relations enriches our understanding of the Thucydides’ trap and points out new directions in the rationalist theories of war."}
{"title": "Destined for War: Can America and China Escape Thucydides's Trap?", "authors": "James C MacDougall", "journal": "Parameters", "year": 2017, "cited": 3, "abstract": "Professor Graham Allison gazes into the future of US-China relations in Destined for War: Can America and China Escape Thucydides’s Trap? only to find the best guide to the future is the past. Specifically based on Thucydides’s well-known observation that “It was the rise of Athens and the fear that this inspired in Sparta that made war inevitable,” Allison has popularized the phrase “Thucydides’s Trap” to describe the dangerous historical dynamic that develops when a rising power threatens to displace an established ruling power. This dynamic was summarized aptly in an earlier article: “The rise of a new power has been attended by uncertainty and anxieties. Often, though not always, violent conflict has followed. The rise in the economic and military power of China, the world’s most populous country, will be a central question for Asia and for American foreign policy at the beginning of a new century. ”"}
{"title": "Handle him with care: The importance of getting Thucydides right", "authors": "Jonathan Kirshner", "journal": "Security Studies", "year": 2019, "cited": 11, "abstract": "Scholars from numerous disciplines continue to study, debate, and value Thucydides’ The Peloponnesian War. This review essay first explores and elaborates many of the enduring and vital contributions of Thucydides for IR theory. It then assesses and engages three new books, including a major, wide-ranging collection of new essays and a very influential (and deeply flawed) attempt to apply the lessons of that work—one that warns of a “Thucydides Trap” that might unwittingly ensnare the United States and China, resulting in an unwanted and catastrophic war between the two. This review essay argues that, as illustrated by the books under consideration here, contemporary IR scholars would be very well served by taking Thucydides seriously and would benefit from reading and considering his History with great care; at the same time, there are enormous, perilous analytical dangers inherent in attempting to draw conclusions from a superficial reading of The Peloponnesian War."}
{"title": "Alleviating the Thucydides' Trap through Welfare State Dependence: How the Funding Needs of the Western Welfare State Can Influence Multilateral Relations with China", "authors": "Emilios Avgouleas & Vasilis Trigkas", "journal": "Global Policy", "year": 2020, "cited": 0, "abstract": "The dual threat of a US–China confrontation and the rise of populism in the West due, in part, to the gradual decay of the welfare state, paint an ominous picture for the future of the post‐war status quo of ever‐expanding prosperity. Hegemonic competition between the incumbent superpower (the USA) and the challenger (China) framed as the Thucydides' Trap and adverse demographic and financial trends are the main causes behind both crises. In this paper, we argue that amidst deteriorating demographics, the sustainability of the Western welfare state could be significantly enhanced by positioning Western institutional investments in the regions across India and South East Asia – areas with strong modernization dynamics and the world's nascent most populous middle class. Such a policy could generate long‐term higher risk‐adjusted returns for Western pension funds, especially if Western investors look for complementarities with China's Belt and Road Initiative (BRI). The proposed geographical calibration in Western institutional investments could lead to a relationship of strong reciprocal dependence between economic and social growth in the target regions, exports of Chinese construction and financial capacity, and Western welfare state viability. We call the suggested policy the ‘welfare state dependence’ hypothesis. The key objective of the hypothesis is the promotion of peaceful economic and geopolitical co‐existence in Eurasia through rational re‐alignment of the incentives of Western polities with Eurasian growth. But to make this new approach feasible, a number of BRI policy reforms that support its multilateralization are required."}
{"title": "In the shadow of the Thucydides trap: International relations theory and the prospects for peace in US-China relations", "authors": "Oriana Skylar Mastro", "journal": "Journal of Chinese Political Science", "year": 2019, "cited": 4, "abstract": "Rising powers and the consequent shifts in the balance of power have long been identified as critical challenges to the international order. What is the likelihood that China and the United States will fall into the Thucydides Trap, meaning that the two countries will fight a major war during a potential power transition? This article creates a framework of seven variables, derived from dominant international relations theories and Graham Allison’s “twelve clues for peace,” that predict the likelihood of major conflict between a rising and an established power: degree of economic interdependence, degree of institutional constraints, domestic political system, nature of relevant alliances, nature of nuclear weapons programs, the sustainability of the rising power’s growth, and its level of dissatisfaction. It then evaluates the values of these variables in the context of the U.S.-China relationship to determine whether pessimism about the prospects of peace is warranted. This analysis leads to more mixed conclusions about the prospects of peace than liberal international relations theory and Allison’s twelve clues would suggest. This research further operationalizes power transition theory and has practical implications for U.S. policy toward China."}
{"title": "China's Strategic Nuclear Arms Control: Avoiding the 'Thucydides Trap'", "authors": "Stephen J. Cimbala", "journal": "Military and Strategic Affairs", "year": 2015, "cited": 2, "abstract": "The “Thucydides Trap” refers to the propensity in history for rising states to challenge putative hegemons or other leading powers for international position, sometimes resulting in war. China’s growing military and economic power in the twenty-first century challenges American and Russian leadership on international security issues, including nuclear arms control and nonproliferation. Yet strategic nuclear arms reductions have still proceeded in a two-sided framework of US-Russian negotiations. Despite obvious difficulties, China should be brought into the process of US-Russian nuclear arms reductions because China is rising as a nuclear power and moving beyond its Cold War minimum deterrence posture."}
{"title": "The Economic Thucydides Trap between China and the US", "authors": "Jiong Gong", "journal": "Turkish Policy Quarterly", "year": 2018, "cited": 1, "abstract": "There is a looming China-US trade war, which carries important implications for both countries’ economies and the global economy. Although US President Donald Trump has a consistent position against the trade deficit, the more important reasons underlying US trade actions are attributed to corporate China’s rise in innovation and its increasing global competitiveness. The US side views this through the lens of an economic Thucydides Trap, which postulates that China’s waxing economic power poses a direct challenge to the US. The author argues that the Chinese and American economies are fundamentally intertwined and complementary. Thus, there is hope of escaping this trap if both corporate China and corporate America find ways to coexist and engage in a coopetition relationship. "}
{"title": "Is There a Thucydides Trap? If So, Can Washington and Beijing Avoid It?", "authors": "Walter C. Clemens Jr.", "journal": "Asian Perspective", "year": 2017, "cited": 1, "abstract": "“IT WAS THE RISE OF ATHENS AND THE FEAR THAT THIS INSTILLED IN Sparta that made war inevitable.” So wrote Thucydides in the fifth century BCE. Will the rise of China and the anxiety this instills in the United States make war inevitable in the twenty-first century? Each of the books reviewed here addresses this question. Each approaches it from a different angle. Each reaches far back in time to provide insight into present-day problems. Each captures the nuances and contradictions in Chinese as well as American feelings and thinking. Each of the four monographs reviewed makes a major contribution to understanding these issues and to responding to them in a constructive manner. Each book provides a model of systematic investigation, objective deliberation, deep and wide sourcing—plus empathy for each player on this global chessboard. The fifth book, an anthology of shorter articles by experts on various aspects of US and Chinese policies, provides material to support as well as to challenge Allison’s thesis."}
{"title": "Role of Third-Party Guarantors in Uncertainty of Preventive Civil War: Can Thucydides Trap Be Resolved?", "authors": "Kaoru Ishiguro & Kazuya Yamamoto", "journal": "Emerging Risks in a World of Heterogeneity", "year": 2018, "cited": 1, "abstract": "The “Thucydides trap” refers to situations where a war is impending between countries in power transition. Formal models of commitment problems in international relations studies demonstrate the ineffectualness of peace promises in such situations. Fearon’s temporal power shift model associated with resource division problems is a typical one. His model has been expanded to include third-party guarantors while retaining complete information. This study incorporates uncertainty in the model and addresses the question of why some conflicts are resolved by guarantors while others are not. It argues that uncertainties about intervention and costs that accompany conflicts cause the difference. The main findings suggest that suspicions about third-party intervention on the part of domestic actors lead to fighting. Additionally, maintaining peace is more likely to be difficult if the declining actor’s cost of fighting is uncertain, while power shifts of large magnitude prolong conflicts."}
{"title": "Elites and Imperial Ambitions: A Symposium: The Real Thucydides Trap", "authors": "Lowell Gustafson", "journal": "Humanitas", "year": 2018, "cited": 2, "abstract": "The study of intellectual history is desirable for its own sake. Asking what ancient authors meant and how we should understand them today is important, partly because we need to consider how they might help us better deal with our pressing current problems. In this article, we consider a current problem of politics and how an ancient author helps us approach it. What does a book written 2,500 years ago have to offer us today? Is the condition of humanity indeed similar enough to think that what happened in an extraordinarily different time and condition could happen in some similar way? No doubt Thucydides would have been amazed by computers, airplanes, and all that distinguishes our age from his. But he may well have felt rather at home in many of the political relationships that characterize the human condition."}
{"title": "The Myth of “Thucydides Trap”: A Study of the New Model of Sino-US Relations", "authors": "Chen Jian-guang", "journal": "Journal of Guangxi Normal University(Philosophy and Social Sciences Edition)", "year": 2017, "cited": 1, "abstract": "By studying the history carefully,we find that the reason why the two cities of Athens and Sparta fell into the Thucydides Trap in Peloponnesian war was not because of the Sparta's fear induced by growing Athenian power,but mainly because the core interests of Sparta was challenged by Athens.Therefore,whether the core interests of the rising power or the predominant power is threatened or not is the primary cause of the war.Western people generally consider that the rising China and the United States will be doomed to fall into Thucydides Trap like Athens and Sparta.In fact,it is wrong to generalize the competition relationship between China and America in the era of globalization.Whether or not the United States respects the core interests of China is the key factor that decides whether the two countries will fall into a Thucydides Trap or not.To construct a new model of Sino-US relations,both sides should control and handle existing differences and disparities properly,play down the ideological conflict,and China's core interests should be respected by America as well.Also,cooperation in all fields is needed to be carried out with the United Nations as the core,which is a great strategy to avoid the Thucydides Trap between America and China."}
{"title": "Destined for War: Can America and China Escape Thucydides's Trap?", "authors": "Yusuke Tega", "journal": "International Relations of the Asia-Pacific", "year": 2017, "cited": 1, "abstract": "In the book, Graham Allison warns that ‘the war between the United States and China in the decades ahead is not just possible, but much more likely than currently recognized’. His core concept is ‘Thucydides’ Trap’. This metaphor is based on the well-known quote from the ancient Greek historian Thucydides’s The History of the Peloponnesian War: ‘It was the rise of Athens and the fear that this inspired in Sparta that made war inevitable.’ Allison argues that the friction between the United States and China (People’s Republic of China) will result in cataclysmic war unless the two states take difficult and painful..."}
{"title": "State Representative: The Thucydides Trap and the Future of Global Governance", "authors": "Mohamed S. Helal", "journal": "Proceedings of the ASIL Annual Meeting", "year": 2019, "cited": 0, "abstract": "Imagining an alternative institutional and normative architecture for global governance must proceed on the bases of an identification and understanding of the principal challenges facing the international system. In my view, the gravest challenge facing the international system, and perhaps the greatest political drama if the twenty-first century, is the ongoing shift in the global"}
{"title": "Thucydides' Trap and Online Readers' Reviews of Two Books on Zheng He's Voyages", "authors": "Dexin Tian & Chin-Chung Chao", "journal": "International Journal of Communication", "year": 2017, "cited": 0, "abstract": "This article analyzes 458 online readers’ reviews of two books on Zheng He’s seven voyages. Under the theoretical guidance of reader response criticism and via the research methods of website observation and purposive selection and textual and thematic analyses, this study has found: influenced by such dominant Chinese cultural values as harmony, benevolence, and mutual benefits, Zheng He’s voyages were non-aggressive exchanges of trade and culture, showing basically no evidence of hostile attitudes, offensive actions, or beclouded emotions of fear, hubris, and honor. Instead of supporting the trustworthiness of Thucydides’ trap, the online readers’ reviews call on tapping the complementary aspects between China and the United States and drawing invaluable lessons from the past for mutually-beneficial bilateral relationship."}
{"title": "Thucydides' Trap,'Ideology or Economic Bias?", "authors": "Niccolo Leo Caldararo", "journal": "Ideology or Economic Bias", "year": 2017, "cited": 0, "abstract": "A confused idea of Greek history has become a policy concept for many Anglo-American politicians and journalists. Based on an article by historian Graham Allison, the idea asserts that in any historical context a rising economic region or nation will come into military conflict with earlier social entities. Allison argues that this was the underlying cause of the Peloponnesian Wars. This is an incorrect assertion and gross distortion of the Greek history. Such deterministic ideas are simplistic and dangerous if they become models for policy. Athens was a mercantilist political entity that extended its power by conquest creating and empire. Sparta was an agriculturalist polity, who formed alliances to balance Athens’ aggression. The nature of power and how it is used is key to understanding history, and in the case of Athens, power led to aggression, conquest and challenge. The current political situation, especially with China is discussed as well as the effects of colonialism."}